### Forest: Snapshot Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.external.sources_tar: Reading...
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=bf2fb8bb754ae81923ccce9ef2c67fde95aa747f]
module.daily_snapshot.data.external.sources_tar: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=bb114775501e5ce236d30db09696d7c942c52a49]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/14512061520513425405]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=377968175]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=dfacde1e-cd3f-4b42-8265-b08fa2766567]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-10-04T13:35:32Z" -> (known after apply)
      ~ disk                 = 200 -> (known after apply)
      ~ id                   = "377968175" -> (known after apply)
      ~ ipv4_address         = "138.197.178.108" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-snapshot"
      ~ price_hourly         = 0.125 -> (known after apply)
      ~ price_monthly        = 84 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:377968175" -> (known after apply)
      ~ user_data            = "1dc52e474cf2babb0a34e74c2e4b3e0d2eaa9046" -> "0283505b7ac0e81c2efd57a30bf41184ff5c623d" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 377968175,
        ] -> (known after apply)
        id              = "dfacde1e-cd3f-4b42-8265-b08fa2766567"
        name            = "forest-snapshot"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:377968175",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "138.197.178.108",
        ],
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>